Revit 2024 API
BuiltInFailures.CurtainWallFailures.GridOutsideWall Property
 Curtain wall grid lines are outside wall. If you are trying to shorten the wall, please remove grid lines, including mullions on top of them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GridOutsideWall { get; }
Visual Basic
Public Shared ReadOnly Property GridOutsideWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GridOutsideWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace